app/views/cart/createBooking.html.erb


            <% bookingshowing = Bookingshowing.find_by_id(id) %>
            <% booking = Booking.find_by_id(bookingshowing.booking_id) %>
---
SELECT  "bookingshowings".* FROM "bookingshowings" WHERE "bookingshowings"."id" = 1 LIMIT ?  [["LIMIT", 1]]
SELECT  "showings".* FROM "showings" WHERE "showings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]