app/views/cart/index.html.erb

    <% @cart.each do |id| %>
        <% showing = Showing.find_by_id(id) %>
        <% screen = Screen.find_by_id(showing.screen_id) %>
        <% film = Film.find_by_id(showing.film_id) %>
---
SELECT  "showings".* FROM "showings" WHERE "showings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "screens".* FROM "screens" WHERE "screens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]