app/views/devise/registrations/edit.html.erb

      <% @bookings= Booking.all %>
      <% @lastbooking = Booking.where(user_id: current_user.id).last %>
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? ORDER BY "bookings"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]