app/views/showings/index.html.erb

SELECT "screens".* FROM "screens" WHERE "screens"."id" = ?  [["id", 1]]
SELECT "films".* FROM "films" WHERE "films"."id" = ?  [["id", 1]]
---
<% @showings.each do |showing| %>
  <% @thisscreen = Screen.where(id: showing.screen_id) %>
  <% @thisfilm = Film.where(id: showing.film_id) %>