app/views/bookings/index.html.erb

      <% @bookings.each do |booking| %>
       <% @thisuser = User.where(id: booking.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]