app/views/bookings/show.html.erb

SELECT "bookingshowings".* FROM "bookingshowings" WHERE "bookingshowings"."booking_id" = ?  [["booking_id", 6]]
---
  <b>Booking Date:</b> <%= @booking.bookingdate %> <br> <b>Status: </b> <%= @booking.status %><br>
      <%  @bookingshowings = Bookingshowing.where(booking_id: @booking.id) %>