app/controllers/bookings_controller.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def set_booking
      @booking = Booking.find(params[:id])