app/controllers/bookingshowings_controller.rb

SELECT "bookingshowings".* FROM "bookingshowings"
---
  def index
    @bookingshowings = Bookingshowing.all

SELECT  "bookingshowings".* FROM "bookingshowings" WHERE "bookingshowings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "showings".* FROM "showings" WHERE "showings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_bookingshowing
      @bookingshowing = Bookingshowing.find(params[:id])