app/controllers/films_controller.rb

SELECT "films".* FROM "films"
---
  def index
    @films = Film.all

INSERT INTO "films" ("title", "filmcast", "plot", "poster_url", "trailer_url", "runtime", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @film = Film.new(film_params)

    respond_to do |format|
      if @film.save

UPDATE "films" SET "plot" = ?, "updated_at" = ? WHERE "films"."id" = ?  [["plot", "A team of commandos on a mission in a Central American jungle find themselves hunted by an extraterrestrial warrior. [IMDB]"], ["updated_at", "2017-12-12 17:06:09.556619"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @film.update(film_params)

DELETE FROM "films" WHERE "films"."id" = ?  [["id", 2]]
---
  def destroy
    @film.destroy

SELECT  "films".* FROM "films" WHERE "films"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_film
      @film = Film.find(params[:id])