app/controllers/screens_controller.rb

SELECT  "screens".* FROM "screens" ORDER BY "screens"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @screens = Screen.all

SELECT  "screens".* FROM "screens" ORDER BY "screens"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def show
     @lastscreen = Screen.last

UPDATE "screens" SET "seating" = ?, "updated_at" = ? WHERE "screens"."id" = ?
---
            i+=1
        end

        @lastscreen.update_attributes(:seating => seatarr)

INSERT INTO "screens" ("screenname", "rows", "width", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["screenname", "screen5"], ["rows", 3], ["width", 3], ["created_at", "2017-12-12 22:14:12.767858"], ["updated_at", "2017-12-12 22:14:12.767858"]]
---
  def create
    @screen = Screen.new(screen_params)

    respond_to do |format|
      if @screen.save

UPDATE "screens" SET "screenname" = ?, "updated_at" = ? WHERE "screens"."id" = ?  [["screenname", "Screen1"], ["updated_at", "2017-12-12 23:02:55.329325"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @screen.update(screen_params)

DELETE FROM "screens" WHERE "screens"."id" = ?  [["id", 6]]
---
  def destroy
    @screen.destroy

SELECT  "screens".* FROM "screens" WHERE "screens"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def set_screen
      @screen = Screen.find(params[:id])