app/controllers/showingseatallocations_controller.rb

SELECT "showingseatallocations".* FROM "showingseatallocations"
---
  def index
    @showingseatallocations = Showingseatallocation.all

INSERT INTO "showingseatallocations" ("seatallocation", "rows", "width", "showing_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @showingseatallocation = Showingseatallocation.new(showingseatallocation_params)

    respond_to do |format|
      if @showingseatallocation.save

SELECT  "showingseatallocations".* FROM "showingseatallocations" WHERE "showingseatallocations"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_showingseatallocation
      @showingseatallocation = Showingseatallocation.find(params[:id])