app/controllers/showings_controller.rb

SELECT "showings".* FROM "showings" WHERE (film_id IN (SELECT DISTINCT "films"."id" FROM "films" WHERE (lower(title) LIKE lower('%a%') OR lower(filmcast) LIKE lower('%a%') OR lower(plot) LIKE lower('%a%'))))
---
  def search
    @search_term = params[:q]
    st = "%#{params[:q]}%"
   # films = Film.where( '(title like ?) OR (filmcast like ?)', st ).select(:id).distinct
   puts 'st'
   #Product.where("lower(name) = ?", name.downcase).first


    films = Film.where('lower(title) LIKE lower(:search) OR lower(filmcast) LIKE lower(:search) OR lower(plot) LIKE lower(:search)', search: st).select(:id).distinct
    @showings = Showing.where("film_id IN (?)", films)

SELECT  "showings".* FROM "showings" ORDER BY "showings"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    @showings = Showing.all

SELECT  "showings".* FROM "showings" ORDER BY "showings"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT  "screens".* FROM "screens" WHERE "screens"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "showings".* FROM "showings" WHERE "showings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "showings" SET "seatallocation" = ?, "updated_at" = ? WHERE "showings"."id" = ?  [["seatallocation", "A01N A02N A03N A04N A05N B01N B02N B03N B04N B05N C01N C02N C03N C04N C05N D01N D02N D03N D04N D05N "], ["updated_at", "2017-12-12 23:07:28.945433"], ["id", 7]]
---
  def show

    @lastshowing = Showing.last

 #   puts 'lastshowing screen_id: ' + @lastshowing.screen_id.to_s
#    puts 'lastshowing film_id: ' + @lastshowing.film_id.to_s
#    puts 'lastshowing.screen_id ' + @lastshowing.screen_id.to_s
#    puts 'lastshowing.seating ' + @lastshowing.seatallocation.to_s

    @thisscreen = Screen.find_by_id(@lastshowing.screen_id)
 #   puts 'thisscreen.seating ' + @thisscreen.seating.to_s

    if @lastshowing.seatallocation == "" || @lastshowing.seatallocation.nil?

      @thisscreen = Screen.find_by_id(@lastshowing.screen_id)

 #     puts 'thisscreen.seating ' + @thisscreen.seating.to_s
      @lastshowing.update_attributes(:seatallocation => @thisscreen.seating)

INSERT INTO "showings" ("slot", "price", "screen_id", "film_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["slot", "2017-12-25 00:00:00"], ["price", 10.0], ["screen_id", 1], ["film_id", 1], ["created_at", "2017-12-10 21:20:02.829329"], ["updated_at", "2017-12-10 21:20:02.829329"]]
---
  def create
    @showing = Showing.new(showing_params)

    respond_to do |format|
      if @showing.save

UPDATE "showings" SET "seatallocation" = ?, "updated_at" = ? WHERE "showings"."id" = ?
---
  def update
    respond_to do |format|
      if @showing.update(showing_params)

DELETE FROM "showings" WHERE "showings"."id" = ?  [["id", 3]]
---
  def destroy
    @showing.destroy

SELECT  "showings".* FROM "showings" WHERE "showings"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_showing
      @showing = Showing.find(params[:id])