app/controllers/static_pages_controller.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = ? ORDER BY "bookings"."id" DESC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "films".* FROM "films"
---
  def home
    @showings = Showing.all
    @bookings = Booking.all
    if user_signed_in?
      @lastbooking = Booking.where(user_id: current_user.id).last
    end

    @films = Film.all

SELECT  "bookings".* FROM "bookings" ORDER BY "bookings"."id" DESC LIMIT ?  [["LIMIT", 1]]
UPDATE "bookings" SET "status" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["status", "Paid by User: user@cinemob.com"], ["updated_at", "2017-12-12 19:31:52.922922"], ["id", 8]]
---
  def paid

    flash[:notice] = 'Transaction Complete'

    @booking = Booking.last
    @booking.update_attribute(:status , "Paid by User: #{current_user.email}")