app/controllers/subscriptions_controller.rb

SELECT "subscriptions".* FROM "subscriptions"
---
  def index
    @subscriptions = Subscription.all