app/views/layouts/_header.html.erb

                <% showingid = showingseatarr[0] %>
                <% showing = Showing.find_by_id(showingid) %>
---
SELECT  "showings".* FROM "showings" WHERE "showings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]